[["achievements",{"version":2,"data":{"vecHighlight":[],"vecUnachieved":[],"vecAchievedHidden":[],"nTotal":0,"nAchieved":0}}],["achievementmap",{"version":5,"data":"[]"}],["usernews",{"version":5,"data":[]}],["gameactivity",{"version":5,"data":[]}],["associations",{"version":2,"data":{"rgDevelopers":[{"strName":"Kunos Simulazioni","strURL":"https://store.steampowered.com/developer/505Games"}],"rgPublishers":[{"strName":"505 Games","strURL":"https://store.steampowered.com/publisher/505Games"}],"rgFranchises":[{"strName":"Assetto Corsa","strURL":"https://store.steampowered.com/franchise/AssettoCorsa"}]}}],["descriptions",{"version":1,"data":{"strFullDescription":"[p][img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/805550/extras/7650cc6797db1e099a624be028360a6a.avif?t=1740392896[/img][/p][p][b]Assetto Corsa Competizione is the new official GT World Challenge videogame. [/b]\r\n[/p][p]Thanks to the extraordinary quality of simulation, the game will allow you to experience the real atmosphere of the GT3 championship, competing against official drivers, teams, cars and circuits reproduced in-game with the highest level of accuracy ever achieved.  \r\n[/p][p]Sprint, Endurance and Spa 24 Hours races will come to life with an incredible level of realism, in both single and multiplayer modes. \r\n[/p][p]Assetto Corsa Competizione is born from KUNOS Simulazioni's long-term experience, and it takes full advantage of Unreal Engine 4 to ensure photorealistic weather conditions and graphics, night races, motion capture animations, reaching a new standard in terms of driving realism and immersion, thanks to its further improved tyre and aerodynamic models. \r\n[/p][p]Designed to innovate, Assetto Corsa Competizione will be set to promote eSports, bringing players at the heart of the GT World Challenge and putting them behind the wheel of Ferraris, Lamborghinis, McLarens and many other prestigious GT racing cars, all reproduced with outstanding level of detail.\r\n[/p][p]\r\n[/p][p][b]REALISTIC SIMULATION[/b]\r\n[/p][p]Assetto Corsa Competizione is designed to faithfully recreate the performance and the driving experience of real GT World Challenge cars through a sophisticated mathematical model that accurately replicates tyre grip, aerodynamic impact, engine parameters, suspensions and electronics systems that determine vehicle balance, as well as the influence of mechanical damage on the car's drivability.\r\n[/p][p]\r\n[/p][p][b]NEW-GENERATION GRAPHICS AND VISUAL EFFECTS[/b]\r\n[/p][p]Unreal Engine 4 guarantees photorealistic rendering and an accurate representation of scenarios, car materials and weather conditions. Thanks to the multi-channel audio sampling of real GT cars, the game conveys captivating and immersive acoustic surroundings and realistic environmental effects.\r\n[/p][p]\r\n[/p][p][img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/805550/extras/ef78d8c93cc69ab7cdb0a94f1f6559a6.avif?t=1740392896[/img][/p][p][b]CARE FOR DETAILS[/b]\r\n[/p][p]Even the secondary details are faithfully reproduced to make you feel the thrill of being in the cockpit of a real racing car. Doors, windshield wipers, headlights, racing lights, racing equipment and control devices such as ABS, traction control, engine ignition and ECU mapping, are all under the driver’s management to assure the best performance and offer the player total control of the car.\r\n[/p][p]\r\n[/p][p][b]THE MOST ACCURATE CIRCUITS[/b]\r\n[/p][p]Thanks to Laserscan technology, every official circuit is recreated with the utmost accuracy: all curbs and details perfectly fit their real counterparts to grant a gaming experience as faithful to reality as possible.\r\n[/p][p]\r\n[/p][p][img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/805550/extras/517204d86ca2d6aa517d43fc9dd5436e.avif?t=1740392896[/img][/p][p][b]ADVANCED MULTIPLAYER FUNCTIONALITY[/b]\r\n[/p][p]A well-structured ranking system will evaluate individual performance and driving behaviour to reward the most virtuous drivers and promote fair play in online competitions. The matchmaking function makes sure that you can compete with opponents of similar skill level and easily find online races to join, while the leaderboards will allow you to compare single-lap performance with drivers from all around the world with the same car, circuit and weather conditions.\r\n[/p][p]\r\n[/p][p][b]IMMERSIVE SINGLE PLAYER EXPERIENCE[/b]\r\n[/p][p]Career, Championship and Free Play modes offer a complete and customizable gaming experience, also thanks to the tutorials and progressive aid levels that allow you to tailor AI opponent difficulty and vehicle stability control to your abilities. The Special Events will allow you to gain a first-hand experience of the most noteworthy real-life GT World Challenge.\r\n[/p][p]\r\n[/p][p][b]HIGH-LEVEL HARDWARE COMPATIBILITY[/b]\r\n[/p][p]Assetto Corsa Competizione ensures full compatibility with a wide range of peripherals from gamepads to professional steering wheels.\r\n[/p][p]\r\n[/p][p][b]MOTION CAPTURE FOR REALISTIC ANIMATIONS[/b] \r\n[/p][p]Motion capture technology is used to create the animations of mechanics and drivers in an even more realistic fashion, and guarantee a high level of player engagement during races, pit stops and driver changes. \r\n\r\n[/p]","strSnippet":"Assetto Corsa Competizione, the official GT World Challenge videogame. Thanks to the extraordinary quality of simulation, you will experience the atmosphere of the GT3 championship. Compete against official drivers, teams, cars and official circuits reproduced to the highest quality ever seen."}}]]